class MasterSections:

    @staticmethod
    def start() -> str:
        return "👋 Привіт. Радий тебе бачити.\nПочнімо працювати!"

    @staticmethod
    def dates_section() -> str:
        return (
            "👋 Вітаю в розділі керування датами."
            "Тут ви можете додавати, видаляти та переглядати ваші вільні дати!"
        )

    @staticmethod
    def services_section() -> str:
        return (
            "👋 Вітаю в розділі керування послугами!\n"
            "Тут ви можете створювати нові послуги, редагувати наявні або видаляти їх."
            "Зробімо ваш бізнес ще кращим!"
        )

    @staticmethod
    def bookings_section() -> str:
        return (
            "👋 Вітаю в розділі керування записами!"
            "Тут ви можете переглядати записи ваших клієнтів."
        )
