class SectionMessages:

    @staticmethod
    def start() -> str:
        return "👋 Привіт. Радий тебе бачити.\nПочнімо працювати!"

    @staticmethod
    def time_slots() -> str:
        return (
            "👋 Керуй своїм часом!\n"
            "Тут ти можеш створювати, видаляти й переглядати вільні віконця для клієнтів."
        )

    @staticmethod
    def services() -> str:
        return (
            "👋 Вітаю в розділі керування послугами!\n"
            "Тут ви можете створювати нові послуги, редагувати наявні або видаляти їх."
            "Зробімо ваш бізнес ще кращим!"
        )

    @staticmethod
    def bookings() -> str:
        return (
            "👋 Вітаю в розділі керування записами!"
            "Тут ви можете переглядати записи ваших клієнтів."
        )

    @staticmethod
    def contacts() -> str:
        return (
            "👋 Вітаю в розділі керування контактами!\n"
            "Тут ви можете додавати або оновлювати інформацію про вас. Що бажаєте зробити?"
        )
